# -*- coding: utf-8 -*-
"""
Created on Wed Sep 20 20:29:24 2017

@author: 91432
"""

import re

#re.match,从字符串的第一位开始匹配
#^是起始位置，\s空格，\d数字，\w字母，.*中间省略，结尾
content='hello 123 45 adele_ is so good haha'
#==============================================================================
# result=re.match('^hello\s\d\d\d\s\d{2}\s\w{2}.*haha$',content)
# print(result)
#==============================================================================

# .*匹配中间所有字符
#==============================================================================
# result=re.match('^hello.*haha$',content)
# print(result)
#==============================================================================

#匹配123 45.把左端点和右端点指定一下.用result.group提取小括号里的东西
#==============================================================================
# result=re.match('^hello\s(\d+)\s.*haha$',content)
# print(result)
# print(result.group(1))
#==============================================================================

#贪婪匹配 .*
#==============================================================================
# result=re.match('^he.*(\d+).*haha$',content)
# print(result)
# print(result.group(1)) #.*匹配尽可能多
#==============================================================================

#非贪婪模式 .*?
#==============================================================================
# result=re.match('^he.*?(\d+).*haha$',content)
# print(result)
# print(result.group(1)) #.*？匹配尽可能少
#==============================================================================

#匹配模式 .*不能匹配换行符.要加上re.S之后，.*也可以匹配换行符了
#==============================================================================
# content='''hello 123 45 adele_ is so good haha 
# grammy'''
# result=re.match('^he.*?(\d+).*grammy$',content,re.S)
# print(result)
#==============================================================================

#转义 特殊字符 加上\ \
content='kesha is ke$ha'
result=re.match('kesha is ke\$\ha',content)
print(result)

#总结：1.尽量用泛匹配 .* 2.非贪婪匹配 .*? 3.匹配模式，用小括号括起来
#4.换行符 re.S






